Syntax : DataFrame.merge(parameters)

Parameters :

right : DataFrame or named Series
how : {‘left’, ‘right’, ‘outer’, ‘inner’}, default ‘inner’
on : label or list
left_on : label or list, or array-like
right_on : label or list, or array-like
left_index : bool, default False
right_index : bool, default False
sort : bool, default False
suffixes : tuple of (str, str), default (‘_x’, ‘_y’)
copy : bool, default True
indicator : bool or str, default False
validate : str, optional
Returns : A DataFrame of the two merged objects.

In [1]:
# importing the module 
import pandas as pd 

# creating the first DataFrame 
df1 = pd.DataFrame({"fruit" : ["apple", "banana", "avocado"],"market_price" : [21, 14, 35]}) 
display("The first DataFrame") 
display(df1) 

# creating the second DataFrame 
df2 = pd.DataFrame({"fruit" : ["banana", "apple", "avocado"], "wholesaler_price" : [65, 68, 75]}) 
display("The second DataFrame") 
display(df2) 

# joining the DataFrames 
display("The merged DataFrame") 
pd.merge(df1, df2, on = "fruit", how = "inner")

'The first DataFrame'

     fruit  market_price
0    apple            21
1   banana            14
2  avocado            35

'The second DataFrame'

     fruit  wholesaler_price
0   banana                65
1    apple                68
2  avocado                75

'The merged DataFrame'

     fruit  market_price  wholesaler_price
0    apple            21                68
1   banana            14                65
2  avocado            35                75

In [2]:

# joining the DataFrames --left 
display("The merged DataFrame") 
pd.merge(df1, df2, on = "fruit", how = "left")

'The merged DataFrame'

     fruit  market_price  wholesaler_price
0    apple            21                68
1   banana            14                65
2  avocado            35                75

In [3]:

# joining the DataFrames --Right
display("The merged DataFrame") 
pd.merge(df1, df2, on = "fruit", how = "right")

'The merged DataFrame'

     fruit  market_price  wholesaler_price
0   banana            14                65
1    apple            21                68
2  avocado            35                75

In [4]:

# joining the DataFrames --outer
display("The merged DataFrame") 
pd.merge(df1, df2, on = "fruit", how = "outer")

'The merged DataFrame'

     fruit  market_price  wholesaler_price
0    apple            21                68
1   banana            14                65
2  avocado            35                75